scenarios/muc.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>

<tsung loglevel="notice" dumptraffic="true" version="1.0">

<clients>
    <client host="127.0.0.1" use_controller_vm="true" maxusers="5000" weight="2" />
</clients>

<servers>
    <server host="127.0.0.1" port="5222" type="tcp"/>
</servers>

<load>
  <arrivalphase phase="1" duration="10" unit="minute">
    <users interarrival="0.2" unit="second"></users>
  </arrivalphase>
</load>

  <!-- JABBER parameters -->
  <options>
    <option type="ts_jabber" name="muc_service" value="conference.localhost"/>

    <option type="ts_jabber" name="domain" value="localhost"></option>
    <!-- Here we are using username /password from CSV files -->
    <option type="ts_jabber" name="userid_max" value="0" />
    <option type="ts_jabber" name="fileid_delimiter" value=","/>
    <option type="ts_jabber" name="random_from_fileid" value='userdb'/>
    <option name="file_server" id='userdb' value="/usr/local/tsung/fixtures/userdb.csv"/>

  </options>

<sessions>
  <session bidi="true" probability="100" name="jabber-muc" type="ts_jabber">

    <setdynvars sourcetype="file" fileid="userdb" delimiter="," order="iter">
      <var name="username" />
      <var name="password" />
    </setdynvars>

    <request subst='true'>
      <jabber type="connect" ack="no_ack">
        <xmpp_authenticate username="%%_username%%" passwd="%%_password%%"/>
      </jabber>
    </request>
    <thinktime value="2"></thinktime>

    <transaction name="authenticate">
      <request><jabber type="auth_get" ack="local"></jabber></request>
      <request><jabber type="auth_set_plain" ack="local"></jabber></request>
    </transaction>

    <thinktime value="2"></thinktime>

    <!-- send presence -->
    <request><jabber type="presence:initial" ack="no_ack"/></request>

    <transaction name="roster">
      <request> <jabber type="iq:roster:get" ack="local"></jabber></request>
    </transaction>

    <!-- join room -->
    <setdynvars sourcetype="value" value="4825a44b95-4825b44b95">
      <var name="room" />
    </setdynvars>
    <request subst="true">
      <jabber type='muc:join' ack="local" room="%%_room%%"/>
    </request>
    <thinktime value="10"/>

    <!-- send 10 messages to the room -->
    <for from="1" to="10">
      <request subst="true"><jabber type="muc:chat" ack="local" room="%%_room%%"/></request>
      <thinktime value="5"/>
    </for>

    <!-- close session -->
    <thinktime value="2"/>
    <transaction name="close">
      <request><jabber type="close" ack="no_ack"></jabber></request>
    </transaction>
  </session>
</sessions>
</tsung>